{
  "basics":{
    "summary": "I am a hard-working, self-motivated and enthusiastic computer engineer looking for a challenging opportunity. I define my self as a proactive team member who has been part of different type of projects offering solutions ranging from DevOps, docker, CI/CD and backend services. I am willing to join your company since I can add extra value to your team by my international experience and broad knowledge."
  },
  "work": [
    {
      "company": "Intelydrone (Argentina)",
      "position": "Backend Developer",
      "website": "http://www.intelydrone.com",
      "startDate": "2018-02",
      "endDate": "2018-10",
      "summary": "Freelance: comprehensive software development project. I developed a full project including customer's scopes and database development for a farm tech company to track livestock. I currently maintain their servers and improve their services.",
      "highlights": [
        "CentOS, Docker, MongoDB, NodeJS, Swagger"
      ]
    },
    {
      "company": "DilMedica (Argentina)",
      "position": "FullStack Developer",
      "startDate": "2016-06",
      "endDate": "2018-10",
      "summary": "Freelance: comprehensive software development project. I developed a full project including customer's scopes and database development for a prosthesis distributor company. I currently maintain their servers and improve their services.",
      "highlights": [
        "Java, SQLite, Java EE, JasperReports"
      ]
    },
    {
      "company": "Torneo InterCollege (Argentina) (Freelance)",
      "position": "Android Developer",
      "startDate": "2015-03",
      "endDate": "2016-10",
      "summary": "Freelance: comprehensive software development project. I developed an android application including customer's scopes and database development for a soccer tournament.",
      "highlights": [
        "Android, Java, SQLite, Java EE"
      ]
    },
    {
      "company": "Library and Drugstore (Argentina)",
      "position": "FullStack Developer",
      "startDate": "2013-11",
      "endDate": "2016-10",
      "summary": "Freelance: comprehensive software development project. I developed a full project including customer's scopes and database development. I currently maintain their servers and improve their services.",
      "highlights": [
        "Java, SQLite, Java EE, Jasper Reports"
      ]
    }
  ],
  "volunteer": [
  ],
  "education": [
    {
      "institution": "ITS Villada, Argentina",
      "area": "Electronic Service Technician",
      "studyType": "High School",
      "startDate": "2006-01-01",
      "endDate": "2011-12-01",
      "gpa": "8.5/10",
      "courses": []
    }
  ],
  "awards": [],
  "publications": [],
  "skills": [
  ],
  "languages": [
  ],
  "interests": [
  ],
  "references": []
}
