{
  "basics":{
    "summary": "I am a hard-working, self-motivated and enthusiastic computer engineer looking for a challenging opportunity. I define my self as a proactive team member who has been part of different type of projects offering solutions ranging from DevOps, Docker, CI/CD and backend services. I focus on using the latest tools and technologies in order to produce better code quality and to reduce time every-day-tasks. I am willing to join your company since I can add extra value to your team by my international experience and broad knowledge. "
  },
  "work": [
    {
      "company": "Sola IO (Australia)",
      "position": "Team Developer Leader",
      "website": "https://www.sola.io",
      "startDate": "2019-12",
      "summary": "Company that sells and provide services about solar panels. I'm in charge of a team that give service to different types of software products used inside the company.",
      "highlights": [
        "Gitlab CI/CD, Docker, AWS, Angular, Android, Ionic, NodeJS, Java, Javascript"
      ]
    },
    {
      "company": "Farmbot (Australia)",
      "position": "Backend Developer",
      "website": "https://www.farmbot.com.au",
      "startDate": "2019-12",
      "endDate": "2019-12",
      "summary": "(One month Contract) Company that produces and sells weather monitors to farms. I'm in charge of develop a service (database and API) to let third party companies access user's data using OAuth process.",
      "highlights": [
        "Docker, AWS, NodeJS, NestJS, Javascript, TypeORM, Swagger"
      ]
    },
    {
      "company": "Reply (Italy)",
      "position": "DevOps Engineer",
      "website": "https://www.reply.it",
      "startDate": "2019-07",
      "endDate": "2019-08",
      "summary": "Software consultant company. I was part of a team in charge of a energy company applications and systems. I setup Jenkins pipelines to run different types of tests using ci/cd tools and send reports over Slack to  different working teams.",
      "highlights": [
        "Jenkins, Docker, Load Impact, Puppeteer, SiteSpeed, SonarQube"
      ]
    },
    {
      "company": "RavimoShark (France)",
      "position": "Software Architecture, Cloud Engineer and Full Stack Developer",
      "website": "http://www.ravimoshark.com",
      "startDate": "2017-06",
      "summary": "Company which sells and rents dishwashers to restaurants. I started as intern to develop an Android native application but over the time I became the person in charge of the complete enterprise systems. I have been developing Angular and Android applications, improving backend services and setting up different environments in Azure Cloud. At the beginning, I was working in the office but after the first 6 months I started working remotely from Argentina and now from Australia.",
      "highlights": [
        "Android, Angular, Azure, Docker, Hibernate, Jasper Reports, Java, MSSQL, NodeJS, Swagger, Keycloak, Netflix Eureka"
      ]
    },
    {
      "company": "Singleton Software Development",
      "position": "CoFounder",
      "website": "http://www.singletonsd.com",
      "startDate": "2014-01",
      "endDate": "2019-10",
      "summary": "CoFounded a software company which provides IT services ranging from development of mobile application, web applications, backend services and database migrations to servers maintenance. The following list are clients to which I sold my service and I continue to provide maintenance over the years as either developer or consultant. Most of them are still in contact with me. All of these jobs were carried out by have to contact the costumer, make a proposal within a budget of time and money and make continues iteration over their requirements.",
      "highlights": [
        "TLC (2018-2019): package delivery company. Position: Software Architecture, Cloud Engineer and Full Stack Developer. I developed a full project including customer's scopes, API services, frontend web application and database. I currently maintain their servers and improve their services. Technologies: Angular, CentOS, Docker, MySQL, NodeJS, Swagger, TypeScript",
        "Intelydrone (2018-2019): farm tech company which provides livestock tracking. Position: Software Architecture, Cloud Engineer and Backend Developer. Technologies: CentOS, Docker, MongoDB, NodeJS, Swagger.",
        "DilMedica (2016-2018): supplier company of medical prosthesis. Position: Software Architecture and Java EE Developer. I  developed a Java Desktop Application to creates invoices, payslips and budgets. Technologies: Java, SQLite, Java EE, JasperReports",
        "FiscalizAR (2015-2019): It's a personal project which I started to help counting votes in Argentina's election. To summarize, It is an android application and a web angular application to track counting votes of different political parties. Technologies: Android, Angular, Docker, MySQL, NodeJS, SQLite, Swagger, TypeScript",
        "Torneo InterCollege (2015-2016): amateur soccer tournament. Position: Software Architecture and Android Developer. I developed  an android application to show soccer players information and statistics about the tournament and a Java EE Desktop Application to submit data. Technologies: Android, Java, SQLite, Java EE",
        "Libraries and Drugstores (2013-2016): small to medium businesses that sells products to final costumers. I developed a software to track stock, sell products and report about selling and suppliers. It started as a one type project but over the time I managed to sell it to more costumers. Technologies: Java, SQLite, Java EE, Jasper Reports."
      ]
    },
    {
      "company": "Intelydrone (Argentina)",
      "position": "Backend Developer",
      "website": "http://www.intelydrone.com",
      "startDate": "2018-02",
      "endDate": "2018-10",
      "summary": "Freelance: comprehensive software development project. I developed a full project including customer's scopes and database development for a farm tech company to track livestock. I currently maintain their servers and improve their services.",
      "highlights": [
        "CentOS, Docker, MongoDB, NodeJS, Swagger"
      ]
    },
    {
      "company": "DilMedica (Argentina)",
      "position": "FullStack Developer",
      "startDate": "2016-06",
      "endDate": "2018-10",
      "summary": "Freelance: comprehensive software development project. I developed a full project including customer's scopes and database development for a prosthesis distributor company. I currently maintain their servers and improve their services.",
      "highlights": [
        "Java, SQLite, Java EE, JasperReports"
      ]
    },
    {
      "company": "Torneo InterCollege (Argentina) (Freelance)",
      "position": "Android Developer",
      "startDate": "2015-03",
      "endDate": "2016-10",
      "summary": "Freelance: comprehensive software development project. I developed an android application including customer's scopes and database development for a soccer tournament.",
      "highlights": [
        "Android, Java, SQLite, Java EE"
      ]
    },
    {
      "company": "Library and Drugstore (Argentina)",
      "position": "FullStack Developer",
      "startDate": "2013-11",
      "endDate": "2016-10",
      "summary": "Freelance: comprehensive software development project. I developed a full project including customer's scopes and database development. I currently maintain their servers and improve their services.",
      "highlights": [
        "Java, SQLite, Java EE, Jasper Reports"
      ]
    }
  ],
  "volunteer": [
  ],
  "education": [
  ],
  "awards": [],
  "publications": [],
  "skills": [
  ],
  "languages": [
  ],
  "interests": [
  ],
  "references": [
    {
      "name": "Josseph Assouline  joseph.assouline1@gmail.com"
    },
    {
      "name": "Giuseppe Gambino  giu.gambino@reply.it"
    }
  ]
}
